feat: ajusta design mkdocs
